function initMap(){
    const CENTER = { lat: 50.4499537018197, lng: 30.52306832256555 };
      const LOCATIONS = [
        [50.434760468146926, 30.55723434755328, 'Києво-Печерська лавра', `
        <h2 class="info-list">Києво-Печерська лавра</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://img.pravda.com/images/doc/5/f/5fb990e-630-360-1547128749-599.jpg">
            </li>
            <li>
              <a href="tel:+38039999999">тел. 380442551105</a>
            </li>
            <li>
                <p>
                Ки́єво-Пече́рська ла́вра — православний монастирський комплекс що<br> переданий в оренду Українській православній церкві (РПЦвУ) в Києві, Україна.
                <br>Один із найбільших християнських центрів-святинь країни. Визначна пам'ятка<br> історії та архітектури.
                Києво-Печерська лавра належить державі, а релігійні<br> організації користуються нею на правах оренди.
                Заснована 1051 року як<br> печерний монастир за межами Києва. Свою назву отримала від печер, де<br> оселилися перші його мешканці
                У середньовіччі був оплотом православ'я Русі.
                </p>
            </li>
          </ul>
        </p>
        <a href="https://goo.gl/maps/7rkxVGSAs5skLsaX8" class="info-link">Як дістатись</a>
        `],
        [50.45423555572514, 30.514222008315144, 'Софійський собор', `
        <h2 class="info-list">Софійський собор</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://discover.in.ua/uploads/illustrations/%D0%A1%D0%BE%D1%84%D1%96%D1%8F-%D0%9A%D0%B8%D1%97%D0%B2%D1%81%D1%8C%D0%BA%D0%B0-%D0%A1%D0%BE%D1%84%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%B8%D0%B9-%D1%81%D0%BE%D0%B1%D0%BE%D1%80.jpg" width="485" height="299">
            </li>
            <li>
              <a href="tel:+30939999999">тел. 0442782620</a>
            </li>
            <li class="text">
                <p>
                    Софі́йський собо́р, або Софі́я Ки́ївська — визначна пам'ятка історії та архітектури України, розташована на Софійській площі міста Києва. Збудований у 1011–1018[9] роках київським князем Ярославом. Названий на честь Святої Софії. Мав статус катедрального собору. З перервами був резиденцією київських митрополитів (православних та унійних). До XIII століття використовувався як головна церква Русі, місце поховання великих князів київських. При соборі велося літописання, була створена перша бібліотека. Занепав у XIV столітті. Відновлений стараннями митрополита Петра Могили і гетьмана Івана Мазепи. Був головним храмом Софійського монастиря (з 1638). Складова Національного заповідника «Софія Київська» (з 1934). Поєднує візантійський і бароковий архітектурні стилі. Одна з небагатьох уцілілих споруд часів Русі. Пам'ятка української архітектури та монументального живопису XI—XVIII століть. Об'єкт Світової спадщини ЮНЕСКО (1990).
                </p>
            </li>
          </ul>
        </p>
        <a href="https://goo.gl/maps/VpFVF4mWzzQLEBx68" class="info-link">Як дістатись</a>
        `],
        [50.4452187072619, 30.52856169050079, 'Будинок Городецького', `
        <h2 class="info-list">Будинок Городецького</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://f.kyivmaps.com/photo/5195/utKqn.jpg" width="485" height="299">
            </li> 
            <li>
              <a href="tel:+30939999999">тел. 0442557333</a>
            </li>
            <li class="text">
                <p>
                    Буди́нок із химе́рами(1901–1902) — цегляна споруда з прикрасами міфологічних та мисливських сюжетів, є головною архітектурною спорудою раннього неоготичного стилю Києва, столиці України. Свою назву отримала завдяки скульптурним прикрасам, тематика яких — тваринний наземний та підводний світи, атрибути полювання, міфічні істоти.
                </p>
            </li>
          </ul>
        </p>
        <a href="https://goo.gl/maps/GTETi5tnWySuUvxK6" class="info-link">Як дістатись</a>
        `],
        [50.453619509994034, 30.516521263157045, 'Пам`ятник Богданові Хмельницькому', `
        <h2 class="info-list">Пам'ятник Богданові Хмельницькому</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://f.kyivmaps.com/location/1828/NqSO7.jpg" width="485" height="299">
            </li> 
            <li>
              <a href="tel:+30939999999">тел. 0990499994</a>
            </li>
            <li class="text">
                <p>
                    Па́м'ятник Богда́нові Хмельни́цькому в Ки́єві — пам'ятка мистецтва ХІХ століття, один із символів Києва. Урочисто відкритий 11 (23) липня 1888 року на Софійській площі в рамках святкування 900-річчя Хрещення Русі.
                </p>
            </li>
          </ul>
        </p>
        <a href="https://goo.gl/maps/WrNPXt6PTsJRXfLe8" class="info-link">Як дістатись</a>
        `],
        [50.4558587008226, 30.52301277349682, 'Михайлівський золотоверхий монастир', `
        <h2 class="info-list">Михайлівський золотоверхий монастир</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://vandrivka.com.ua/wp-content/uploads/2016/05/Mihajlivskij-Zolotoverhij-monastir-Kiyiv-35.jpg" width="485" height="299">
            </li>
            <li>
              <a href="tel:+30939999999">тел. 0442288720</a>
            </li>
            <li class="text">
                <p>
                Свято-Михайлівський Золотоверхий монастир — діючий православний монастир на честь Архангела Михаїла в Києві, кафедральний собор Православної церкви України.
                Оригінальний храм спорудили в 1108–1113 роках за правління онука Ярослава Мудрого київського князя Святополка Ізяславича. Хрестово-купольний шестистовпний храм з трьома навами та одним позолоченим куполом. На початку XX століття храм — семикупольний. У 1930-х роках був зруйнований, а відтворений у 1997—1998 роках. Михайлівський Золотоверхий собор збудовано з каміння і цегли-плінфи на вапняно-цем'яковому розчині технікою «мішаної кладки» з використанням голосників у пазухах склепінь. Стіни собору прикрашали мозаїки і фрески. Був одним з найбільших монастирів Стародавнього Києва.
                </p>
            </li>
          </ul>
        </p>
        <a href="https://goo.gl/maps/7aEUdFcpAjWerPdF6" class="info-link">Як дістатись</a>
        `],
        [50.44507620231799, 30.508754364694333, 'Володимирський кафедральний собор', `
        <h2 class="info-list">Володимирський кафедральний собор</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://www.cerkva.info/wp-content/uploads/2019/07/Volodimirskij-sobor-Kiyiv-1-1800x1175-1.jpg" width="485" height="299">
            </li>
            <li>
              <a href="tel:+30939999999">тел. 0442355385</a>
            </li>
            <li class="text">
                <p>
                    Володимирський собор (собор святого рівноапостольного великого князя Володимира) — православний собор у Києві, до створення Православної Церкви України, був головним храмом Української Православної Церкви Київського Патріархату.
                    Собор зведено у 1862—1882 роки.
                    Собор побудовано в руському неовізантійському стилі, початковий проєкт собору склали архітектори Іван Штром і Павло Спарро; пізніше його переробив архітектор Олександр Беретті. У споруджені собору брали участь архітектори Рудольф Бернгард, Карл Маєвський, Володимир Ніколаєв.
                    Собор у плані — традиційний давньоруський шестистовпний триапсидний храм, але увінчаний сімома банями.
                </p>
            </li>
          </ul>
        </p>
        <a href="https://goo.gl/maps/2uoCvSDtgnjYaMmt5" class="info-link">Як дістатись</a>
        `],
        [50.4488297950652, 30.513324401888458, 'Золоті ворота', `
        <h2 class="info-list">Золоті ворота</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://ua.igotoworld.com/frontend/webcontent/websites/1/images/gallery/7830_800x600_1280px-Brama_Zoloti_Vorota.jpg" width="485" height="299">
            </li>
            <li>
              <a href="tel:+30939999999">тел. 0442786919</a>
            </li>
            <li class="text">
                <p>
                    Золоті́ воро́та — головна брама стародавнього Києва, пам'ятка оборонної архітектури Київської Русі, одна з найдавніших датованих споруд Східної Європи, символ Києва. Свою назву одержали за аналогією із Золотими воротами в Константинополі (Царгороді).
                    Історик Микола Закревський назвав Золоті ворота: «дорогоцінним залишком давньої величі й слави Києва».
                </p>
            </li>
          </ul>
        </p>
        <a href="https://goo.gl/maps/oRnkN48WvHfLwbhGA" class="info-link">Як дістатись</a>
        `],
        [50.448467745726894, 30.537611244414993, 'Маріїнський палац', `
        <h2 class="info-list">Маріїнський палац</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://upload.wikimedia.org/wikipedia/commons/5/51/%D0%9C%D0%B0%D1%80%D1%96%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BF%D0%B0%D0%BB%D0%B0%D1%86_%D0%B2_%D0%9A%D0%B8%D1%94%D0%B2%D1%96_%28cropped%29.jpg" width="485" height="299">
            </li>
            <li>
              <a href="tel:+30939999999">тел. 0985494671</a>
            </li>
            <li class="text">
                <p>
                Марії́нський пала́ц у Києві ― офіційна церемоніальна резиденція президента України. Зведений у 1750–1755 роках за зразком палацу, який проєктував Вартоломей Растреллі для Олексія Розумовського, фаворита та фактичного чоловіка імператриці Єлизавети Петрівни. Під час відвідування Києва 1744 року Єлизавета сама обрала для нього місце.
                Назва «Маріїнський» закріпилася за палацом з 1950-х років, від Маріїнського парку навпроти, до цього палац мав назву Царський.
                У незалежній Україні в Маріїнському палаці проходять урочисті державні події — нагородження, приймання, вручення вірчих грамот послами іноземних держав і зустрічі офіційних делегацій на найвищому рівні.
                5 квітня 2022 року Президент України Володимир Зеленський оголосив, що Біла зала Маріїнського палацу, в якій керівництво держави приймає глав іноземних держав, матиме назву Біла зала Героїв України й тут нагороджуватимуть тих, кому присвоєно звання Героя України.
                </p>
            </li>
          </ul>
        </p>
        <a href="https://goo.gl/maps/Uwr5qiUTYHfwPrnT9" class="info-link">Як дістатись</a>
        `],
        [50.42819168445715, 30.51782742167574, 'Костел Св. Миколая', `
        <h2 class="info-list">Костел Св. Миколая</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://inkyiv.com.ua/wp-content/uploads/2020/06/Oblozhka-1.jpeg" width="485" height="299">
            </li>
            <li>
              <a href="tel:+30939999999">тел. 0445295044</a>
            </li>
            <li class="text">
                <p>
                    Костел Свято́го Микола́я в Києві — римо-католицький костел у Києві, один з двох римсько-католицьких у місті, побудованих до 1917 року. Розташований у центрі Києва на Великій Васильківській вулиці.
                </p>
            </li>
          </ul>
        </p>
        <a href="https://goo.gl/maps/VYS2N13X1zwkhTDD8" class="info-link">Як дістатись</a>
        `],
        [50.45944367115554, 30.5179059927418, 'Андріївська церква', `
        <h2 class="info-list">Андріївська церква</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://gdb.rferl.org/04A98CC8-A59B-421F-B185-1300CD626151_w1200_r1.jpg" width="485" height="299">
            </li>
            <li>
              <a href="tel:+30939999999">тел. 0445990005</a>
            </li>
            <li class="text">
                <p>
                    Андрі́ївська це́рква — православна церква на честь Святого Андрія у стилі бароко, пам'ятка архітектури та монументального живопису XVIII ст. світового значення у Києві, споруджена за проектом видатного архітектора Бартоломео Растреллі. Входить до складу Національного заповідника «Софія Київська». Церкву запропоновано внести до списку Всесвітньої спадщини ЮНЕСКО.[2][3][4] 18 жовтня 2018 року Верховна Рада України ухвалила закон «Про особливості користування Андріївською церквою Національного заповідника «Софія Київська» (№ 9208), на підставі якого Андріївська церква передана у безоплатне користування Вселенському патріархату, і у ній облаштована Ставропігія Константинопольського патріархату, при цьому церква й надалі залишається музеєм у складі Національного заповідника «Софія Київська»
                </p>
            </li>
          </ul>
        </p>
        <a href="https://goo.gl/maps/gxqk6W2Y7cdRrMfy8" class="info-link">Як дістатись</a>
        `],
        [50.44960660858945, 30.525417407297436, 'Монумент Незалежності', `
        <h2 class="info-list">Монумент Незалежності</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://upload.wikimedia.org/wikipedia/commons/3/36/17-07-02-Maidan_Nezalezhnosti_RR74397.jpg" width="485" height="299">
            </li>
            <li class="text">
                <p>
                    Монуме́нт Незале́жності — тріумфальна колона в Києві, присвячена незалежності України. Розташована у центрі міста на Майдані Незалежності.
                </p>
            </li>
          </ul>
        </p>
        <a href="https://goo.gl/maps/3jSD4dkwd8MMCvBp9" class="info-link">Як дістатись</a>
        `],
        [50.45922843183636, 30.52685314058299, 'Київський річковий вокзал', `
        <h2 class="info-list">Київський річковий вокзал</h2>
        <p>
          <ul style="list-style: none; padding: 0;" class="list">
            <li>
                <img src="https://f.sko4.com/photo/5589/z4CeU.png" width="485" height="299">
            </li>
            <li>
              <a href="tel:+30939999999">тел. 0443911442</a>
            </li>
            <li class="text">
                <p>
                    Ки́ївський річкови́й вокза́л — головний річковий порт Києва, розташований на правому березі Дніпра на Подолі в історичній частині міста.
                </p>
            </li>
          </ul>
        </p>
        <a href="https://g.page/KyivRiverStation?share" class="info-link">Як дістатись</a>
        `],
        [50.45994660950713, 30.526080218575576, 'Поштова площа', `
        <h2 class="info-list">Поштова площа</h2>
        <p>
            <ul style="list-style: none; padding: 0;" class="list">
                <li>
                    <img src="https://f-guide.kyivcity.gov.ua/location/11639/kk4og.jpg" width="485" height="299">
                </li>
                <li>
                    <a href="tel:+30939999999">тел. 0443911442</a>
                </li>
                <li class="text">
                    <p>
                        Пошто́ва пло́ща — площа у Подільському районі міста Києва, місцевість Поділ. Розташована між Володимирським узвозом, Боричевим узвозом, вулицею Петра Сагайдачного, Набережно-Хрещатицькою і Набережним шосе.
                    </p>
                </li>
            </ul>
        </p>
        <a href="https://goo.gl/maps/hdLv78WdeUps9cjQA" class="info-link">Як дістатись</a>
        `],
        [50.465852306848696, 30.517219624114915, 'Контрактова площа', `
        <h2 class="info-list">Контрактова площа</h2>
        <p>
            <ul style="list-style: none; padding: 0;" class="list">
                <li>
                    <img src="https://www.depo.ua/uploads/365651/conversions/29f49d4100af4b5a568b38cda6c35139-wide-big.jpg" width="485" height="299">
                </li>
                <li>
                    <a href="tel:+30939999999">тел. 0443911442</a>
                </li>
                <li class="text">
                    <p>
                        Контракто́ва пло́ща — площа в Подільському районі міста Києва, місцевість Поділ. Розташована між вулицею Петра Сагайдачного, Покровською вулицею, Андріївським узвозом, Фролівською вулицею, Притисько-Микільською вулицею, Костянтинівською вулицею, Межигірською вулицею, Спаською вулицею, вулицею Григорія Сковороди та Іллінською вулицею.
                    </p>
                </li>
            </ul>
        </p>
        <a href="https://goo.gl/maps/WeYAuB6jgNpNihdE9" class="info-link">Як дістатись</a>
        `],
        [50.46667854670338, 30.498489477633637, 'Щекавиця', `
        <h2 class="info-list">Щекавиця</h2>
        <p>
            <ul style="list-style: none; padding: 0;" class="list">
                <li>
                    <img src="https://f.discover.ua/location/3226/VYKXP.jpg" width="485" height="299">
                </li>
                <li>
                    <a href="tel:+30939999999">тел. 0443911442</a>
                </li>
                <li class="text">
                    <p>
                        Щекави́ця (також Скавика, Олегівка, Олегова Могила) — гора в Києві над Подолом, що має історичне значення. Буде влаштована вечірка судного дня.
                    </p>
                </li>
            </ul>
        </p>
        <a href="https://goo.gl/maps/ERZmtYHozASGrmLVA" class="info-link">Як дістатись</a>
        `]
      ];
      const MAP = new google.maps.Map(document.getElementById("map"), {
        center: CENTER,
        zoom: 15
      });
      document.getElementById('first-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.434760468146926, lng: 30.55723434755328 });
        MAP.zoom(15);
      });
      document.getElementById('second-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.45423555572514, lng: 30.514222008315144 });
      });
      document.getElementById('third-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.4452187072619, lng: 30.52856169050079 });
      });
      document.getElementById('fourth-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.453619509994034, lng: 30.516521263157045 });
      });
      document.getElementById('fifth-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.4558587008226, lng: 30.52301277349682 });
      });
      document.getElementById('sixth-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.44507620231799, lng: 30.508754364694333 });
      });
      document.getElementById('seventh-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.4488297950652, lng: 30.513324401888458 });
      });
      document.getElementById('eighth-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.448467745726894, lng: 30.537611244414993 });
      });
      document.getElementById('ninth-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.42819168445715, lng: 30.51782742167574 });
      });
      document.getElementById('tenth-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.45944367115554, lng: 30.5179059927418 });
      });
      document.getElementById('eleventh-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.44960660858945, lng: 30.525417407297436 });
      });
      document.getElementById('twelveth-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.45922843183636, lng: 30.52685314058299 });
      });
      document.getElementById('thirteenth-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.45994660950713, lng: 30.526080218575576 });
      });
      document.getElementById('fourteenth-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.465852306848696, lng: 30.517219624114915 });
      });
      document.getElementById('fifteenth-monument').addEventListener('click', () => {
        MAP.panTo({ lat: 50.46667854670338, lng: 30.498489477633637 });
      });
    for (let i = 0; i <= LOCATIONS.length; i++) {
        let marker = new google.maps.Marker({
        position: { lat: LOCATIONS[i][0], lng: LOCATIONS[i][1] },
        map: MAP,
        title: LOCATIONS[i][2],
        animation: google.maps.Animation.DROP
      });
      infoMessage(marker, LOCATIONS[i][3], MAP);
    }
    function infoMessage(marker, message, map){
        let infowindow = new google.maps.InfoWindow({
            content: message
        });
        marker.addListener("click", () => {
            infowindow.open({
                anchor: marker,
                map
            });
        });
  }
}